In [3]:
import numpy as np, pandas as pd
from glob import glob
from fetch_data import fetch_data

In [4]:
data_event = fetch_data(20240201,20240331,'event')

In [5]:
data_event[(data_event["default_period_count"] == 5)]

Empty DataFrame
Columns: [match_id, first_to_serve, home_team_seed, away_team_seed, custom_id, winner_code, default_period_count, start_datetime, match_slug, final_result_only]
Index: []

In [ ]:
# ==> there is no 5 set match
# ==> all matchs have 3 set.

<h1>calculate by time table</h1>

In [6]:
data_time = fetch_data(20240201,20240331,'time')

In [7]:
unique_time_data = data_time.drop_duplicates(subset=["match_id"])

In [8]:
correct_data = (unique_time_data ["period_1"].notna() & unique_time_data ["period_2"].notna()) 
unique_time_data  = unique_time_data [correct_data]

In [9]:
unique_time_data.to_csv("../data/external/5/time_set.csv",index=False)

unique_time_data

,match_id,period_1,period_2,period_3,period_4,period_5,current_period_start_timestamp
2,11998445,3259,2639,4202,None,None,1706816851
3,11998446,2488,2375,None,None,None,1706803981
4,11998447,3741,1913,None,None,None,1706798459
5,11998448,2639,3090,None,None,None,1706710960
6,11998449,1500,2708,None,None,None,1706727400
...,...,...,...,...,...,...,...
35666,12213482,5,138,None,None,None,1711985032
35667,12213483,3330,3574,None,None,None,1711982605
35668,12213484,3,5,None,None,None,1711984742
35669,12213486,1968,3697,None,None,None,1711980823
35670,12213803,3185,2588,None,None,None,1711982489

In [10]:
numbers_stop_at_two = np.sum(unique_time_data["period_3"].isna())

total_number = len(unique_time_data)

percentage_of_two_set_match = (numbers_stop_at_two/total_number)*100

float(percentage_of_two_set_match)

69.41325783461878

<h1>calculate by power table</h1>

In [11]:
data_power = fetch_data(20240201,20240331,'power')

In [12]:
unique_columns = ["match_id","set_num"]
unique_power_data = data_power.drop_duplicates(subset=unique_columns)

In [13]:
mask_columns = ["match_id","set_num"]
unique_power_data = unique_power_data[mask_columns]


unique_time_data.to_csv("../data/external/5/power_set.csv",index=False)

unique_power_data

        match_id  set_num
0       11998445        1
12      11998445        2
20      11998445        3
33      11998446        1
43      11998446        2
...          ...      ...
469634  12213484        2
469643  12213486        1
469651  12213486        2
469661  12213803        1
469670  12213803        2

[25463 rows x 2 columns]

In [14]:
np.sum(unique_power_data["set_num"].isna())

np.int64(0)

In [15]:
stop_at_three = (unique_power_data["set_num"] == 3)

numbers_stop_at_two = len(unique_power_data[stop_at_three])
total_number = len(unique_power_data["match_id"].unique())


percentage_of_three_set_match = (numbers_stop_at_two/total_number)*100

In [16]:
percentage_of_two_set_match = 100 - percentage_of_three_set_match
percentage_of_two_set_match

69.85882564517578

<h1>calculate by game info(pbp) table</h1>

In [17]:
data_pbp = fetch_data(20240201,20240331,'pbp')

In [18]:
unique_columns = ["match_id","set_id"]
unique_pbp_data = data_pbp.drop_duplicates(subset=unique_columns)

In [19]:
mask_columns = ["match_id","set_id"]
unique_pbp_data = unique_pbp_data[mask_columns]

unique_time_data.to_csv("../data/external/5/pbp_set.csv",index=False)

unique_pbp_data

         match_id  set_id
0        11998445       3
68       11998445       2
108      11998445       1
159      11998446       2
204      11998446       1
...           ...     ...
2549116  12213484       1
2549155  12213486       2
2549218  12213486       1
2549255  12213803       2
2549304  12213803       1

[25139 rows x 2 columns]

In [20]:
np.sum(unique_pbp_data["set_id"].isna())

np.int64(0)

In [21]:
stop_at_three = (unique_pbp_data["set_id"] == 3)

numbers_stop_at_two = len(unique_pbp_data[stop_at_three])
total_number = len(data_pbp["match_id"].unique())


percentage_of_three_set_match = (numbers_stop_at_two/total_number)*100

In [22]:
percentage_of_two_set_match = 100 - percentage_of_three_set_match
percentage_of_two_set_match

69.7608616283315